docs/books.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Books</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Books</h1>
<p>
Here is a list of books I am working on self studying. Some might link to an
entire repository, others have notes / summary for each chapter.
</p>
<div id="outline-container-orge714635" class="outline-2">
<h2 id="orge714635">k&amp;r</h2>
</div>

<div id="outline-container-org3350ee1" class="outline-2">
<h2 id="org3350ee1">Computer Power and Human Reasoning</h2>
<div class="outline-text-2" id="text-org3350ee1">
</div>
<div id="outline-container-org90ea2bc" class="outline-3">
<h3 id="org90ea2bc">introduction</h3>
<div class="outline-text-3" id="text-org90ea2bc">
<p>
Ok. My mind is kinda blown. Weizenbaum said a bunch of stuff and I'm still
digesting it.
</p>
<ul class="org-ul">
<li>he made eliza</li>
<li>people have faith in science</li>
<li>and this is not much different to theater, pepole must assume that magic is
being done</li>
<li>people don't understand how computers work</li>
<li></li>
</ul>
</div>
</div>
<div id="outline-container-org9dfdce9" class="outline-3">
<h3 id="org9dfdce9">On Tools</h3>
</div>
<div id="outline-container-org95c8465" class="outline-3">
<h3 id="org95c8465">Where the Power of the Computer Comes From</h3>
</div>
<div id="outline-container-org72d12bc" class="outline-3">
<h3 id="org72d12bc">How Computers Work</h3>
</div>
<div id="outline-container-orge9b58ad" class="outline-3">
<h3 id="orge9b58ad">Science and the Compulsive Programmer</h3>
</div>
<div id="outline-container-orga03ebad" class="outline-3">
<h3 id="orga03ebad">Theories and Models</h3>
</div>
<div id="outline-container-orgf8667cc" class="outline-3">
<h3 id="orgf8667cc">Computer Models in Psycology</h3>
</div>
<div id="outline-container-org216a3ea" class="outline-3">
<h3 id="org216a3ea">The Computer and Natural Language</h3>
</div>
<div id="outline-container-orgfc0367d" class="outline-3">
<h3 id="orgfc0367d">Artificial Intelligence</h3>
</div>
<div id="outline-container-org463621d" class="outline-3">
<h3 id="org463621d">Incomprehensible Programs</h3>
</div>
<div id="outline-container-org630859d" class="outline-3">
<h3 id="org630859d">Against the Imperialism of Instrumental Reason</h3>
</div>
</div>
<div id="outline-container-org817b528" class="outline-2">
<h2 id="org817b528">Physics for Computer Science Students</h2>
</div>
<div id="outline-container-org5b83a49" class="outline-2">
<h2 id="org5b83a49">Basic Training in Mathematics</h2>
<div class="outline-text-2" id="text-org5b83a49">
</div>
<div id="outline-container-org0cd4451" class="outline-3">
<h3 id="org0cd4451">Preface</h3>
</div>
<div id="outline-container-org1ef62a8" class="outline-3">
<h3 id="org1ef62a8">Differential Calculus of One Variable</h3>
<div class="outline-text-3" id="text-org1ef62a8">
</div>
<div id="outline-container-org634de41" class="outline-4">
<h4 id="org634de41">Introduction</h4>
</div>
<div id="outline-container-org7cf1ff6" class="outline-4">
<h4 id="org7cf1ff6">Differential Calculus</h4>
</div>
<div id="outline-container-org5f665f9" class="outline-4">
<h4 id="org5f665f9">Exponential and Log Functions</h4>
</div>
<div id="outline-container-org98ee05f" class="outline-4">
<h4 id="org98ee05f">Trigonometric Functionsi</h4>
</div>
<div id="outline-container-orgd632802" class="outline-4">
<h4 id="orgd632802">Plotting Functions</h4>
</div>
<div id="outline-container-orgbd5bfbd" class="outline-4">
<h4 id="orgbd5bfbd">Differentials</h4>
</div>
<div id="outline-container-org4e57f47" class="outline-4">
<h4 id="org4e57f47">Summary</h4>
</div>
</div>
<div id="outline-container-org7c2115c" class="outline-3">
<h3 id="org7c2115c">Integral Calculus</h3>
<div class="outline-text-3" id="text-org7c2115c">
</div>
<div id="outline-container-org7941a80" class="outline-4">
<h4 id="org7941a80">Basics of Integration</h4>
</div>
<div id="outline-container-orgae32aa4" class="outline-4">
<h4 id="orgae32aa4">Some Tricks of the Trade</h4>
</div>
<div id="outline-container-org20ffcaf" class="outline-4">
<h4 id="org20ffcaf">Summary</h4>
</div>
</div>
<div id="outline-container-org67adc41" class="outline-3">
<h3 id="org67adc41">Calculus of Many Variables</h3>
<div class="outline-text-3" id="text-org67adc41">
</div>
<div id="outline-container-orga9b9af2" class="outline-4">
<h4 id="orga9b9af2">Differential Calculus of Many Variables</h4>
</div>
<div id="outline-container-orgbbe9b16" class="outline-4">
<h4 id="orgbbe9b16">Integral Calculus of Many Variables</h4>
</div>
<div id="outline-container-org5c59fbf" class="outline-4">
<h4 id="org5c59fbf">Summary</h4>
</div>
</div>
<div id="outline-container-orgce1c3d2" class="outline-3">
<h3 id="orgce1c3d2">Infinite Series</h3>
<div class="outline-text-3" id="text-orgce1c3d2">
</div>
<div id="outline-container-orgb8062c1" class="outline-4">
<h4 id="orgb8062c1">Introduction</h4>
</div>
<div id="outline-container-org27295d0" class="outline-4">
<h4 id="org27295d0">Tests for Convergence</h4>
</div>
<div id="outline-container-org443bc37" class="outline-4">
<h4 id="org443bc37">Power Series in x</h4>
</div>
<div id="outline-container-org938a63e" class="outline-4">
<h4 id="org938a63e">Summary</h4>
</div>
</div>
<div id="outline-container-org10eaabb" class="outline-3">
<h3 id="org10eaabb">Complex Numbers</h3>
<div class="outline-text-3" id="text-org10eaabb">
</div>
<div id="outline-container-orgf1e2781" class="outline-4">
<h4 id="orgf1e2781">Introductions</h4>
</div>
<div id="outline-container-org3b2b40c" class="outline-4">
<h4 id="org3b2b40c">Complex Numbers in Cartesian Form</h4>
</div>
<div id="outline-container-org27a4d8a" class="outline-4">
<h4 id="org27a4d8a">Polar Form of Complex Numbers</h4>
</div>
<div id="outline-container-org4d65db8" class="outline-4">
<h4 id="org4d65db8">An Application</h4>
</div>
<div id="outline-container-orgafab110" class="outline-4">
<h4 id="orgafab110">Summary</h4>
</div>
</div>
<div id="outline-container-org9475225" class="outline-3">
<h3 id="org9475225">Functions of a Complex Variable</h3>
<div class="outline-text-3" id="text-org9475225">
</div>
<div id="outline-container-org6a9817e" class="outline-4">
<h4 id="org6a9817e">Analytic Functions</h4>
</div>
<div id="outline-container-orge63ab4b" class="outline-4">
<h4 id="orge63ab4b">Analytic Functions Defined by Power Series</h4>
</div>
<div id="outline-container-org43f00f4" class="outline-4">
<h4 id="org43f00f4">Calculus of Analytic Functions</h4>
</div>
<div id="outline-container-org2d99f1d" class="outline-4">
<h4 id="org2d99f1d">The Residue Theorem</h4>
</div>
<div id="outline-container-org2f3f152" class="outline-4">
<h4 id="org2f3f152">Taylor Series for Analytic Functions</h4>
</div>
<div id="outline-container-orgfa5a679" class="outline-4">
<h4 id="orgfa5a679">Summary</h4>
</div>
</div>
<div id="outline-container-org876fa32" class="outline-3">
<h3 id="org876fa32">Vector Calculus</h3>
<div class="outline-text-3" id="text-org876fa32">
</div>
<div id="outline-container-orga552e1d" class="outline-4">
<h4 id="orga552e1d">Review of Vector Analysis</h4>
</div>
<div id="outline-container-org19d5e15" class="outline-4">
<h4 id="org19d5e15">Time Derivatives of Vectors</h4>
</div>
<div id="outline-container-org0cba1e2" class="outline-4">
<h4 id="org0cba1e2">Scalar and Vector Fields</h4>
</div>
<div id="outline-container-orgfabd635" class="outline-4">
<h4 id="orgfabd635">Line and Surface Integrals</h4>
</div>
<div id="outline-container-orge73c568" class="outline-4">
<h4 id="orge73c568">Scalar Field and the Gradient</h4>
</div>
<div id="outline-container-org1dae348" class="outline-4">
<h4 id="org1dae348">Curl of a Vector Field</h4>
</div>
<div id="outline-container-orgb131fec" class="outline-4">
<h4 id="orgb131fec">The Divergence of a Vector Field</h4>
</div>
<div id="outline-container-org3af6531" class="outline-4">
<h4 id="org3af6531">Differential Operators</h4>
</div>
<div id="outline-container-org8015cf4" class="outline-4">
<h4 id="org8015cf4">Summary of Integral Theorems</h4>
</div>
<div id="outline-container-orge6e8e14" class="outline-4">
<h4 id="orge6e8e14">Higher Derivatives</h4>
</div>
<div id="outline-container-org55c9a52" class="outline-4">
<h4 id="org55c9a52">Applications from Electrodynamics</h4>
</div>
<div id="outline-container-org28f170d" class="outline-4">
<h4 id="org28f170d">Summary</h4>
</div>
</div>
<div id="outline-container-org1476eb6" class="outline-3">
<h3 id="org1476eb6">Matrices and Determinants</h3>
<div class="outline-text-3" id="text-org1476eb6">
</div>
<div id="outline-container-org732310c" class="outline-4">
<h4 id="org732310c">Introduction</h4>
</div>
<div id="outline-container-org149a3bb" class="outline-4">
<h4 id="org149a3bb">Matrix Inverses</h4>
</div>
<div id="outline-container-orgcceaaf6" class="outline-4">
<h4 id="orgcceaaf6">Determinants</h4>
</div>
<div id="outline-container-org6af9ec5" class="outline-4">
<h4 id="org6af9ec5">Transformations on Matrices and Special Matrices</h4>
</div>
<div id="outline-container-org2c0bc36" class="outline-4">
<h4 id="org2c0bc36">Summary</h4>
</div>
</div>
<div id="outline-container-orgb20798c" class="outline-3">
<h3 id="orgb20798c">Linear Vector Spaces</h3>
<div class="outline-text-3" id="text-orgb20798c">
</div>
<div id="outline-container-org0d6470c" class="outline-4">
<h4 id="org0d6470c">Linear Vector Spaces: Basics</h4>
</div>
<div id="outline-container-org5edfd11" class="outline-4">
<h4 id="org5edfd11">Inner Product Spaces</h4>
</div>
<div id="outline-container-org0baa12f" class="outline-4">
<h4 id="org0baa12f">Linear Operators</h4>
</div>
<div id="outline-container-org9a869b4" class="outline-4">
<h4 id="org9a869b4">Some Advanced Topics</h4>
</div>
<div id="outline-container-org380684e" class="outline-4">
<h4 id="org380684e">The Eigenvalue Problem</h4>
</div>
<div id="outline-container-org57bea30" class="outline-4">
<h4 id="org57bea30">Applications of Eigenvalue Theory</h4>
</div>
<div id="outline-container-org19fa4b9" class="outline-4">
<h4 id="org19fa4b9">Function Spaces</h4>
</div>
<div id="outline-container-org5663469" class="outline-4">
<h4 id="org5663469">Some Terminology</h4>
</div>
<div id="outline-container-org65a018a" class="outline-4">
<h4 id="org65a018a">Tensors: An introduction</h4>
</div>
<div id="outline-container-org72317fe" class="outline-4">
<h4 id="org72317fe">Summary</h4>
</div>
</div>
<div id="outline-container-org9ee991d" class="outline-3">
<h3 id="org9ee991d">Differential Equations</h3>
<div class="outline-text-3" id="text-org9ee991d">
</div>
<div id="outline-container-org151ecb0" class="outline-4">
<h4 id="org151ecb0">Introduction</h4>
</div>
<div id="outline-container-orgfcd602b" class="outline-4">
<h4 id="orgfcd602b">ODEs with Constant Coefficients</h4>
</div>
<div id="outline-container-org650d16a" class="outline-4">
<h4 id="org650d16a">ODEs with Variable Coefficients: First Order</h4>
</div>
<div id="outline-container-org4feed0d" class="outline-4">
<h4 id="org4feed0d">ODEs with Variable Coefficients: Second Order and Homogenous</h4>
</div>
<div id="outline-container-org626424e" class="outline-4">
<h4 id="org626424e">Partial Differential Equations</h4>
</div>
<div id="outline-container-org378716d" class="outline-4">
<h4 id="org378716d">Green's Function Method</h4>
</div>
<div id="outline-container-org497003f" class="outline-4">
<h4 id="org497003f">Summary</h4>
<div class="outline-text-4" id="text-org497003f">
<p>
**
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
